//==============================================================================================
//
// ゲーム画面のUI　　　gameUI.cpp
// 土田凌聖
//
//==============================================================================================

//**********************************************************************************************
// インクルード
//**********************************************************************************************
#include"UI.h"
#include"application.h"
#include"inputkeyboard.h"
#include"fade.h"

//==============================================================================================
// コンストラクタ
//==============================================================================================
CUI::CUI() : CObject2D(4)
{
	m_nFlashingTime = 0;
	m_nFlashingTime2 = 0;
	m_nFlashingCount = 0;
	m_bEnter = false;
}

//==============================================================================================
// デストラクタ
//==============================================================================================
CUI::~CUI()
{
}

//==============================================================================================
// 初期化処理
//==============================================================================================
HRESULT CUI::Init(D3DXVECTOR3 pos)
{
	CObject2D::Init(pos);

	m_Pos = pos;		// 初期位置
	
	return S_OK;
}

//==============================================================================================
// 終了処理
//==============================================================================================
void CUI::Uninit()
{
	CObject2D::Uninit();
}

//==============================================================================================
// 更新処理
//==============================================================================================
void CUI::Update()
{
	CObject2D::Update();

	CFade::FADE FadeMode = CFade::GetFade();
	CApplication::MODE GameMode = CApplication::GetMode();

	if (CApplication::GetInputKeyboard()->GetKeyboardTrigger(DIK_RETURN) == true && FadeMode != CFade::FADE_IN && GameMode == CApplication::MODE_TITLE)
	{
		m_bEnter = true;
		m_nFlashingCount = 0;
	}

	m_nFlashingCount++;

	if (!m_bEnter)
	{
		Flash(m_nFlashingTime);
	}
	else
	{
		Flash(m_nFlashingTime2);
	}
}

//==============================================================================================
// 描画処理
//==============================================================================================
void CUI::Draw()
{
	CObject2D::Draw();
}

//==============================================================================================
// 生成処理
//==============================================================================================
CUI *CUI::Create(D3DXVECTOR3 pos, CTexture::TEXTURE texture, float width, float height, int flashingtime, int flashingtime2)
{
	CUI *pUI = nullptr;

	pUI = new CUI;

	if (pUI != nullptr)
	{
		pUI->Init(pos);
		pUI->SetSize(width, height);
		pUI->SetTexture(texture);
		pUI->SetFlashigTime(flashingtime, flashingtime2);
	}

	return pUI;
}

//==============================================================================================
// 点滅処理
//==============================================================================================
void CUI::Flash(int flashingtime)
{
	if (flashingtime != 0)
	{
		if (m_nFlashingCount == flashingtime)
		{
			CObject2D::SetCol({ 1.0f, 1.0f, 1.0f, 0.0f });
		}
		else if (m_nFlashingCount == flashingtime * 2)
		{
			CObject2D::SetCol({ 1.0f, 1.0f, 1.0f, 1.0f });
			m_nFlashingCount = 0;
		}
	}
}

//==============================================================================================
// 点滅する間隔の設定
//==============================================================================================
void CUI::SetFlashigTime(int flashingtime, int flashingtime2)
{
	m_nFlashingTime = flashingtime;
	m_nFlashingTime2 = flashingtime2;
}